ycsb/logs/RDMA_BP_16_async_th_28/workloadf.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 83898804, 0.000000
[OVERALL], RunTime(ms), 20102
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4974.629390110436
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 30
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.14923888170331312
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 30
[TOTAL_GC_TIME_%], Time(%), 0.14923888170331312
[READ], Operations, 100000
[READ], AverageLatency(us), 48.61499
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 9111
[READ], 95thPercentileLatency(us), 71
[READ], 99thPercentileLatency(us), 109
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49715
[READ-MODIFY-WRITE], AverageLatency(us), 352.0123503972644
[READ-MODIFY-WRITE], MinLatency(us), 86
[READ-MODIFY-WRITE], MaxLatency(us), 30767
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 748
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1088
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 6442.0
[CLEANUP], MinLatency(us), 6440
[CLEANUP], MaxLatency(us), 6443
[CLEANUP], 95thPercentileLatency(us), 6443
[CLEANUP], 99thPercentileLatency(us), 6443
[UPDATE], Operations, 49715
[UPDATE], AverageLatency(us), 302.304234134567
[UPDATE], MinLatency(us), 55
[UPDATE], MaxLatency(us), 30351
[UPDATE], 95thPercentileLatency(us), 696
[UPDATE], 99thPercentileLatency(us), 1035
[UPDATE], Return=OK, 49715
total zerocopy send size = 0, total send size = 84308766, 0.000000
total zerocopy send size = 0, total send size = 84044797, 0.000000
[OVERALL], RunTime(ms), 20316
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4922.228785193935
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 11
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.054144516637133294
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 11
[TOTAL_GC_TIME_%], Time(%), 0.054144516637133294
[READ], Operations, 100000
[READ], AverageLatency(us), 49.37065
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 8335
[READ], 95thPercentileLatency(us), 72
[READ], 99thPercentileLatency(us), 111
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50023
[READ-MODIFY-WRITE], AverageLatency(us), 353.7064550306859
[READ-MODIFY-WRITE], MinLatency(us), 83
[READ-MODIFY-WRITE], MaxLatency(us), 12135
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 756
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1078
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2151.0
[CLEANUP], MinLatency(us), 2150
[CLEANUP], MaxLatency(us), 2151
[CLEANUP], 95thPercentileLatency(us), 2151
[CLEANUP], 99thPercentileLatency(us), 2151
[UPDATE], Operations, 50023
[UPDATE], AverageLatency(us), 303.1285008895908
[UPDATE], MinLatency(us), 55
[UPDATE], MaxLatency(us), 11639
[UPDATE], 95thPercentileLatency(us), 702
[UPDATE], 99thPercentileLatency(us), 1027
[UPDATE], Return=OK, 50023
[OVERALL], RunTime(ms), 20337
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4917.146088410287
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05900575306092345
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.05900575306092345
[READ], Operations, 100000
[READ], AverageLatency(us), 51.06255
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 128703
[READ], 95thPercentileLatency(us), 75
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49824
[READ-MODIFY-WRITE], AverageLatency(us), 354.7721981374438
[READ-MODIFY-WRITE], MinLatency(us), 86
[READ-MODIFY-WRITE], MaxLatency(us), 129727
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 760
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1091
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 6506.0
[CLEANUP], MinLatency(us), 6504
[CLEANUP], MaxLatency(us), 6507
[CLEANUP], 95thPercentileLatency(us), 6507
[CLEANUP], 99thPercentileLatency(us), 6507
[UPDATE], Operations, 49824
[UPDATE], AverageLatency(us), 301.22752087347465
[UPDATE], MinLatency(us), 53
[UPDATE], MaxLatency(us), 13399
[UPDATE], 95thPercentileLatency(us), 703
[UPDATE], 99thPercentileLatency(us), 1032
[UPDATE], Return=OK, 49824
total zerocopy send size = 0, total send size = 84224630, 0.000000
[OVERALL], RunTime(ms), 20428
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4895.2418249461525
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 14
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.06853338554924614
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 14
[TOTAL_GC_TIME_%], Time(%), 0.06853338554924614
[READ], Operations, 100000
[READ], AverageLatency(us), 50.56374
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 8295
[READ], 95thPercentileLatency(us), 76
[READ], 99thPercentileLatency(us), 115
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49962
[READ-MODIFY-WRITE], AverageLatency(us), 355.2348384772427
[READ-MODIFY-WRITE], MinLatency(us), 88
[READ-MODIFY-WRITE], MaxLatency(us), 211455
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 738
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1073
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2247.0
[CLEANUP], MinLatency(us), 2246
[CLEANUP], MaxLatency(us), 2247
[CLEANUP], 95thPercentileLatency(us), 2247
[CLEANUP], 99thPercentileLatency(us), 2247
[UPDATE], Operations, 49962
[UPDATE], AverageLatency(us), 303.49787838757453
[UPDATE], MinLatency(us), 54
[UPDATE], MaxLatency(us), 210687
[UPDATE], 95thPercentileLatency(us), 682
[UPDATE], 99thPercentileLatency(us), 1013
[UPDATE], Return=OK, 49962
total zerocopy send size = 0, total send size = 84181108, 0.000000
total zerocopy send size = 0, total send size = 84049298, 0.000000
[OVERALL], RunTime(ms), 20454
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4889.019262735896
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 10
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.048890192627358955
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 10
[TOTAL_GC_TIME_%], Time(%), 0.048890192627358955
[READ], Operations, 100000
[READ], AverageLatency(us), 50.66578
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 8063
[READ], 95thPercentileLatency(us), 74
[READ], 99thPercentileLatency(us), 110
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49826
[READ-MODIFY-WRITE], AverageLatency(us), 356.76779191586724
[READ-MODIFY-WRITE], MinLatency(us), 95
[READ-MODIFY-WRITE], MaxLatency(us), 46623
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 756
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1092
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2075.0
[CLEANUP], MinLatency(us), 2074
[CLEANUP], MaxLatency(us), 2075
[CLEANUP], 95thPercentileLatency(us), 2075
[CLEANUP], 99thPercentileLatency(us), 2075
[UPDATE], Operations, 49826
[UPDATE], AverageLatency(us), 304.61534138803034
[UPDATE], MinLatency(us), 60
[UPDATE], MaxLatency(us), 46239
[UPDATE], 95thPercentileLatency(us), 699
[UPDATE], 99thPercentileLatency(us), 1032
[UPDATE], Return=OK, 49826
[OVERALL], RunTime(ms), 20481
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4882.574093061862
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05859088911674235
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.05859088911674235
[READ], Operations, 100000
[READ], AverageLatency(us), 50.92866
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 4571
[READ], 95thPercentileLatency(us), 77
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49924
[READ-MODIFY-WRITE], AverageLatency(us), 356.2315118980851
[READ-MODIFY-WRITE], MinLatency(us), 83
[READ-MODIFY-WRITE], MaxLatency(us), 161023
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 757
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1090
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2419.0
[CLEANUP], MinLatency(us), 2418
[CLEANUP], MaxLatency(us), 2419
[CLEANUP], 95thPercentileLatency(us), 2419
[CLEANUP], 99thPercentileLatency(us), 2419
[UPDATE], Operations, 49924
[UPDATE], AverageLatency(us), 303.92863151991025
[UPDATE], MinLatency(us), 54
[UPDATE], MaxLatency(us), 160255
[UPDATE], 95thPercentileLatency(us), 701
[UPDATE], 99thPercentileLatency(us), 1028
[UPDATE], Return=OK, 49924
total zerocopy send size = 0, total send size = 84188849, 0.000000
[OVERALL], RunTime(ms), 20481
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4882.574093061862
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05859088911674235
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.05859088911674235
[READ], Operations, 100000
[READ], AverageLatency(us), 52.03269
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 188031
[READ], 95thPercentileLatency(us), 73
[READ], 99thPercentileLatency(us), 110
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49932
[READ-MODIFY-WRITE], AverageLatency(us), 353.5967916366258
[READ-MODIFY-WRITE], MinLatency(us), 92
[READ-MODIFY-WRITE], MaxLatency(us), 13695
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 743
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1073
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1763.0
[CLEANUP], MinLatency(us), 1763
[CLEANUP], MaxLatency(us), 1763
[CLEANUP], 95thPercentileLatency(us), 1763
[CLEANUP], 99thPercentileLatency(us), 1763
[UPDATE], Operations, 49932
[UPDATE], AverageLatency(us), 301.912561083073
[UPDATE], MinLatency(us), 59
[UPDATE], MaxLatency(us), 13191
[UPDATE], 95thPercentileLatency(us), 691
[UPDATE], 99thPercentileLatency(us), 1020
[UPDATE], Return=OK, 49932
total zerocopy send size = 0, total send size = 84453102, 0.000000
[OVERALL], RunTime(ms), 20549
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4866.416857267994
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 14
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0681298360017519
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 14
[TOTAL_GC_TIME_%], Time(%), 0.0681298360017519
[READ], Operations, 100000
[READ], AverageLatency(us), 50.1401
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 8703
[READ], 95thPercentileLatency(us), 73
[READ], 99thPercentileLatency(us), 116
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50129
[READ-MODIFY-WRITE], AverageLatency(us), 356.69943545652217
[READ-MODIFY-WRITE], MinLatency(us), 86
[READ-MODIFY-WRITE], MaxLatency(us), 15815
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 765
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1110
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2363.0
[CLEANUP], MinLatency(us), 2362
[CLEANUP], MaxLatency(us), 2363
[CLEANUP], 95thPercentileLatency(us), 2363
[CLEANUP], 99thPercentileLatency(us), 2363
[UPDATE], Operations, 50129
[UPDATE], AverageLatency(us), 305.4165852101578
[UPDATE], MinLatency(us), 55
[UPDATE], MaxLatency(us), 15159
[UPDATE], 95thPercentileLatency(us), 710
[UPDATE], 99thPercentileLatency(us), 1052
[UPDATE], Return=OK, 50129
total zerocopy send size = 0, total send size = 84096402, 0.000000
[OVERALL], RunTime(ms), 20587
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4857.434303201049
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 13
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.06314664594161365
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 13
[TOTAL_GC_TIME_%], Time(%), 0.06314664594161365
[READ], Operations, 100000
[READ], AverageLatency(us), 53.55446
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 205823
[READ], 95thPercentileLatency(us), 73
[READ], 99thPercentileLatency(us), 109
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49858
[READ-MODIFY-WRITE], AverageLatency(us), 356.4802840065787
[READ-MODIFY-WRITE], MinLatency(us), 86
[READ-MODIFY-WRITE], MaxLatency(us), 206975
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 749
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1089
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 6542.0
[CLEANUP], MinLatency(us), 6540
[CLEANUP], MaxLatency(us), 6543
[CLEANUP], 95thPercentileLatency(us), 6543
[CLEANUP], 99thPercentileLatency(us), 6543
[UPDATE], Operations, 49858
[UPDATE], AverageLatency(us), 301.2001484215171
[UPDATE], MinLatency(us), 57
[UPDATE], MaxLatency(us), 14095
[UPDATE], 95thPercentileLatency(us), 696
[UPDATE], 99thPercentileLatency(us), 1032
[UPDATE], Return=OK, 49858
total zerocopy send size = 0, total send size = 84446510, 0.000000
[OVERALL], RunTime(ms), 20596
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4855.311711011847
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 10
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.04855311711011847
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 10
[TOTAL_GC_TIME_%], Time(%), 0.04855311711011847
[READ], Operations, 100000
[READ], AverageLatency(us), 54.91348
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 344319
[READ], 95thPercentileLatency(us), 73
[READ], 99thPercentileLatency(us), 110
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50110
[READ-MODIFY-WRITE], AverageLatency(us), 348.29990021951704
[READ-MODIFY-WRITE], MinLatency(us), 86
[READ-MODIFY-WRITE], MaxLatency(us), 12223
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 733
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1057
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2281.0
[CLEANUP], MinLatency(us), 2280
[CLEANUP], MaxLatency(us), 2281
[CLEANUP], 95thPercentileLatency(us), 2281
[CLEANUP], 99thPercentileLatency(us), 2281
[UPDATE], Operations, 50110
[UPDATE], AverageLatency(us), 297.1758331670325
[UPDATE], MinLatency(us), 55
[UPDATE], MaxLatency(us), 11767
[UPDATE], 95thPercentileLatency(us), 679
[UPDATE], 99thPercentileLatency(us), 1000
[UPDATE], Return=OK, 50110
total zerocopy send size = 0, total send size = 84453292, 0.000000
total zerocopy send size = 0, total send size = 84056239, 0.000000
[OVERALL], RunTime(ms), 20650
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4842.6150121065375
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 10
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.048426150121065374
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 10
[TOTAL_GC_TIME_%], Time(%), 0.048426150121065374
[READ], Operations, 100000
[READ], AverageLatency(us), 51.52503
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 101823
[READ], 95thPercentileLatency(us), 74
[READ], 99thPercentileLatency(us), 112
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50126
[READ-MODIFY-WRITE], AverageLatency(us), 356.5469616566253
[READ-MODIFY-WRITE], MinLatency(us), 91
[READ-MODIFY-WRITE], MaxLatency(us), 147327
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 753
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1090
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2267.0
[CLEANUP], MinLatency(us), 2266
[CLEANUP], MaxLatency(us), 2267
[CLEANUP], 95thPercentileLatency(us), 2267
[CLEANUP], 99thPercentileLatency(us), 2267
[UPDATE], Operations, 50126
[UPDATE], AverageLatency(us), 304.95559190839083
[UPDATE], MinLatency(us), 59
[UPDATE], MaxLatency(us), 146687
[UPDATE], 95thPercentileLatency(us), 697
[UPDATE], 99thPercentileLatency(us), 1031
[UPDATE], Return=OK, 50126
[OVERALL], RunTime(ms), 20658
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4840.739665020815
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05808887598024978
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.05808887598024978
[READ], Operations, 100000
[READ], AverageLatency(us), 52.74118
[READ], MinLatency(us), 28
[READ], MaxLatency(us), 13167
[READ], 95thPercentileLatency(us), 77
[READ], 99thPercentileLatency(us), 115
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49832
[READ-MODIFY-WRITE], AverageLatency(us), 358.51332477123134
[READ-MODIFY-WRITE], MinLatency(us), 95
[READ-MODIFY-WRITE], MaxLatency(us), 13887
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 755
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1107
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1856.0
[CLEANUP], MinLatency(us), 1856
[CLEANUP], MaxLatency(us), 1856
[CLEANUP], 95thPercentileLatency(us), 1856
[CLEANUP], 99thPercentileLatency(us), 1856
[UPDATE], Operations, 49832
[UPDATE], AverageLatency(us), 304.3865588376947
[UPDATE], MinLatency(us), 61
[UPDATE], MaxLatency(us), 9751
[UPDATE], 95thPercentileLatency(us), 697
[UPDATE], 99thPercentileLatency(us), 1046
[UPDATE], Return=OK, 49832
total zerocopy send size = 0, total send size = 84386602, 0.000000
[OVERALL], RunTime(ms), 20724
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4825.323296660877
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 17
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0820304960432349
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 17
[TOTAL_GC_TIME_%], Time(%), 0.0820304960432349
[READ], Operations, 100000
[READ], AverageLatency(us), 53.1518
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 18191
[READ], 95thPercentileLatency(us), 80
[READ], 99thPercentileLatency(us), 126
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50077
[READ-MODIFY-WRITE], AverageLatency(us), 357.99652535095953
[READ-MODIFY-WRITE], MinLatency(us), 79
[READ-MODIFY-WRITE], MaxLatency(us), 19071
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 774
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1130
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2323.0
[CLEANUP], MinLatency(us), 2322
[CLEANUP], MaxLatency(us), 2323
[CLEANUP], 95thPercentileLatency(us), 2323
[CLEANUP], 99thPercentileLatency(us), 2323
[UPDATE], Operations, 50077
[UPDATE], AverageLatency(us), 303.24861712962036
[UPDATE], MinLatency(us), 51
[UPDATE], MaxLatency(us), 10319
[UPDATE], 95thPercentileLatency(us), 715
[UPDATE], 99thPercentileLatency(us), 1067
[UPDATE], Return=OK, 50077
total zerocopy send size = 0, total send size = 84093893, 0.000000
[OVERALL], RunTime(ms), 20766
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4815.5639025329865
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 10
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.04815563902532986
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 10
[TOTAL_GC_TIME_%], Time(%), 0.04815563902532986
[READ], Operations, 100000
[READ], AverageLatency(us), 53.4611
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 7191
[READ], 95thPercentileLatency(us), 82
[READ], 99thPercentileLatency(us), 125
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49862
[READ-MODIFY-WRITE], AverageLatency(us), 359.4724038345835
[READ-MODIFY-WRITE], MinLatency(us), 86
[READ-MODIFY-WRITE], MaxLatency(us), 212607
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 768
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1094
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2277.0
[CLEANUP], MinLatency(us), 2276
[CLEANUP], MaxLatency(us), 2277
[CLEANUP], 95thPercentileLatency(us), 2277
[CLEANUP], 99thPercentileLatency(us), 2277
[UPDATE], Operations, 49862
[UPDATE], AverageLatency(us), 304.8947495086439
[UPDATE], MinLatency(us), 56
[UPDATE], MaxLatency(us), 211839
[UPDATE], 95thPercentileLatency(us), 709
[UPDATE], 99thPercentileLatency(us), 1031
[UPDATE], Return=OK, 49862
total zerocopy send size = 0, total send size = 84327351, 0.000000
[OVERALL], RunTime(ms), 20790
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4810.00481000481
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05772005772005772
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.05772005772005772
[READ], Operations, 100000
[READ], AverageLatency(us), 54.14769
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 305151
[READ], 95thPercentileLatency(us), 75
[READ], 99thPercentileLatency(us), 112
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50043
[READ-MODIFY-WRITE], AverageLatency(us), 361.25422136962214
[READ-MODIFY-WRITE], MinLatency(us), 76
[READ-MODIFY-WRITE], MaxLatency(us), 306943
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 750
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1099
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2391.0
[CLEANUP], MinLatency(us), 2390
[CLEANUP], MaxLatency(us), 2391
[CLEANUP], 95thPercentileLatency(us), 2391
[CLEANUP], 99thPercentileLatency(us), 2391
[UPDATE], Operations, 50043
[UPDATE], AverageLatency(us), 302.84625222308813
[UPDATE], MinLatency(us), 48
[UPDATE], MaxLatency(us), 12471
[UPDATE], 95thPercentileLatency(us), 695
[UPDATE], 99thPercentileLatency(us), 1036
[UPDATE], Return=OK, 50043
total zerocopy send size = 0, total send size = 84330843, 0.000000
[OVERALL], RunTime(ms), 20838
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4798.925040790863
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 16
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0767828006526538
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.0767828006526538
[READ], Operations, 100000
[READ], AverageLatency(us), 55.10807
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 9111
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 131
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50039
[READ-MODIFY-WRITE], AverageLatency(us), 358.4017266532105
[READ-MODIFY-WRITE], MinLatency(us), 74
[READ-MODIFY-WRITE], MaxLatency(us), 17055
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 759
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1102
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2091.0
[CLEANUP], MinLatency(us), 2090
[CLEANUP], MaxLatency(us), 2091
[CLEANUP], 95thPercentileLatency(us), 2091
[CLEANUP], 99thPercentileLatency(us), 2091
[UPDATE], Operations, 50039
[UPDATE], AverageLatency(us), 302.208017746158
[UPDATE], MinLatency(us), 49
[UPDATE], MaxLatency(us), 16623
[UPDATE], 95thPercentileLatency(us), 697
[UPDATE], 99thPercentileLatency(us), 1037
[UPDATE], Return=OK, 50039